"""
Завдання 3
макс 50 балів
зауважте, що значення, що зберігається в кожному елементі - теж словник, і доступ до вкладеного списку
здійснюється за механізмом
student[outer_dict_key][inner_dict_key]

Є дані студентів (комбінація імені та прізвища унікальна), що зберігаються за допомогою словника
1 - програмно добавити одного студента, з заповненням усіх полів (вік - від 18 до 40, цілочисельне значення,
    бал від 0 до 100 (інт чи флоат)
2 - створити і вивести на екран список студентів (імя та прізвище та середній бал), у яких середній бал більше 90
    сам формат наповнення цього списку up to you
3 - визначити середній бал по групі
4 - при відсутності номеру телефону у студента записати номер деканату як значення за замовчуванням (номер на ваш вибір)

не забувайте виводити інформаційні повідомлення щодо інформації, яку ви виводите
"""
student = {
    'Іван Петров': {
        'Пошта': 'Ivan@gmail.com',
        'Вік': 21,
        'Номер телефону': '+380987771221',
        'Середній бал': 95.8
    },
    'Женя Курич': {
        'Пошта': 'Geka@gmail.com',
        'Вік': 22,
        'Номер телефону': None,
        'Середній бал': 64.5
    },
    'Маша Кера': {
        'Пошта': 'Masha@gmail.com',
        'Вік': 18,
        'Номер телефону': '+380986671221',
        'Середній бал': 80
    },
}

# 1 new student
student['Маргарита Калініченко'] = {
        'Пошта': 'Margo@gmail.com',
        'Вік': 25,
        'Номер телефону': None,
        'Середній бал': 97.2
    }


# 2 All students with rate higher than 90
dict_rate = {}

for stud in student:
    if student[stud]['Середній бал'] >= 90:
        dict_rate.update({stud: student[stud]['Середній бал']})
print(f'Студенти, які мають середній бал більший за 90: {dict_rate}')


# 3 Average rate for group
sum_rate = 0

for stud in student:
    sum_rate += student[stud]['Середній бал']
avr_rate = sum_rate / len(student)
print(f'Середній бал по групі: {int(avr_rate)}')

# 4 None phone number
list_stud = []

for stud in student:
    if not student[stud]['Номер телефону']:
        student[stud]['Номер телефону'] = '0482767842'
        list_stud += [stud]
print(f'Номер деканату "0482767842" вказан для студентів: {list_stud}')