"""
Завдання 1
Макс 20 балів
написати програму, яка просить в користувача ввести через пробіл міста, в яких він був за минулі 10 років
потім окремо запросити у користувача міста, куди він хоче поїхати внаступні 10 років
вивести на екран повідомлення з текстом про те, що користувачу, мабуть, дуже сподобалося в містах, які він повторив в
двох циклах вводу, а саме... (сформувати строку, використовуючи join)
якщо повтору не було - вивести повідомлення, що користувач відкритий до чогось нового

врахувати випадки, що користувач нічого не вводить не потрібно, в даному випадку вам явно зазначено,
що ці перевірки не потрібні.
не потрібно перевіряти введення цифр
ми виходим із того, що користувач введе щось на зразок "Київ Тернопіль париЖ акапулько-80"

В той же час врахуйте, що користувач може вводити дані в різних регістрах

використати сети!!!
"""

print("Введіть через пробіл міста, в яких ви були минулі 10 років:")
lst1 = input().lower().split()

for city in lst1[:]:
    if not city.isalpha():
        lst1.remove(city)

set1 = set(lst1)


print("Введіть міста, які ви бажаєте відвідати наступні 10 років:")
lst2 = input().lower().split()

for city in lst2[:]:
    if not city.isalpha():
        lst2.remove(city)

set2 = set(lst2)


set3 = set1 & set2
if (set1 & set2) == set():
    print("Ви відкриті до чогось нового!")
else:
    lst3 = list(set3)
    lst3_str = ", ".join(lst3)
    print(f'Вам, мабуть, сподобалось у містах: {lst3_str.title()}')